#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/flcdrg/terraform-azure-sql-db-replica/runs/run-82g96QN3P51NYAqo

Waiting for the plan to start...

Terraform v1.10.5
on linux_amd64
Initializing plugins and modules...
random_password.password: Refreshing state... [id=none]
data.azurerm_client_config.current: Refreshing...
data.azurerm_resource_group.rg: Refreshing...
data.azurerm_client_config.current: Refresh complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD02MDllM2ZjZC1lNzEzLTQ3MjItODA4Yi0yNTYxMjE0ZGQxNjI7b2JqZWN0SWQ9NzJlYWM3ZWMtMDI0My00NDljLWIxYTctMTU0MTZhMjRkYTBhO3N1YnNjcmlwdGlvbklkPWI0YjJlN2U5LTY2ZTctNDZiNS1hNTZiLWNjZTJiNTAwMTFkNDt0ZW5hbnRJZD01OWIwOTM0ZC00ZjM1LTRiZmYtYTJiNy1hNDUxZmU1ZjhiZDY=]
data.azurerm_resource_group.rg: Refresh complete after 0s [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-georeplica-australiaeast]
azurerm_mssql_server.mssql: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-georeplica-australiaeast/providers/Microsoft.Sql/servers/sql-georeplica-australiaeast]
azurerm_mssql_firewall_rule.azure_services: Refreshing state... [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-georeplica-australiaeast/providers/Microsoft.Sql/servers/sql-georeplica-australiaeast/firewallRules/AllowAzure]
azurerm_mssql_server.mssql: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_mssql_database.primary will be created
  + resource "azurerm_mssql_database" "primary" {
      + auto_pause_delay_in_minutes                                = (known after apply)
      + collation                                                  = "SQL_Latin1_General_CP1_CI_AS"
      + create_mode                                                = "Default"
      + creation_source_database_id                                = (known after apply)
      + enclave_type                                               = (known after apply)
      + geo_backup_enabled                                         = true
      + id                                                         = (known after apply)
      + ledger_enabled                                             = (known after apply)
      + license_type                                               = (known after apply)
      + maintenance_configuration_name                             = (known after apply)
      + max_size_gb                                                = 1
      + min_capacity                                               = (known after apply)
      + name                                                       = "sqldb-georeplica-australiaeast"
      + read_replica_count                                         = (known after apply)
      + read_scale                                                 = (known after apply)
      + restore_point_in_time                                      = (known after apply)
      + sample_name                                                = "AdventureWorksLT"
      + secondary_type                                             = (known after apply)
      + server_id                                                  = "/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-georeplica-australiaeast/providers/Microsoft.Sql/servers/sql-georeplica-australiaeast"
      + sku_name                                                   = "Basic"
      + storage_account_type                                       = "Geo"
      + transparent_data_encryption_enabled                        = true
      + transparent_data_encryption_key_automatic_rotation_enabled = false
      + zone_redundant                                             = false

      + long_term_retention_policy (known after apply)

      + short_term_retention_policy (known after apply)

      + threat_detection_policy (known after apply)
    }

  # azurerm_mssql_database.secondary will be created
  + resource "azurerm_mssql_database" "secondary" {
      + auto_pause_delay_in_minutes                                = (known after apply)
      + collation                                                  = "SQL_Latin1_General_CP1_CI_AS"
      + create_mode                                                = "Secondary"
      + creation_source_database_id                                = (known after apply)
      + enclave_type                                               = (known after apply)
      + geo_backup_enabled                                         = true
      + id                                                         = (known after apply)
      + ledger_enabled                                             = (known after apply)
      + license_type                                               = (known after apply)
      + maintenance_configuration_name                             = (known after apply)
      + max_size_gb                                                = (known after apply)
      + min_capacity                                               = (known after apply)
      + name                                                       = "sqldb-georeplica-secondary-australiaeast"
      + read_replica_count                                         = (known after apply)
      + read_scale                                                 = (known after apply)
      + restore_point_in_time                                      = (known after apply)
      + sample_name                                                = (known after apply)
      + secondary_type                                             = (known after apply)
      + server_id                                                  = "/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-georeplica-australiaeast/providers/Microsoft.Sql/servers/sql-georeplica-australiaeast"
      + sku_name                                                   = "Basic"
      + storage_account_type                                       = "Geo"
      + transparent_data_encryption_enabled                        = true
      + transparent_data_encryption_key_automatic_rotation_enabled = false
      + zone_redundant                                             = (known after apply)

      + long_term_retention_policy (known after apply)

      + short_term_retention_policy (known after apply)

      + threat_detection_policy (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 4 estimated
           $0.0/mo +$0.0

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @flcdrg, Action: `pull_request`*